import { useEffect, useState } from "react";
import SectionHead from "../../module/sectionHead";
import { PRODUCT_LIST } from "../../shared/product";
import "./css/style.css";
import { NavLink } from "react-router-dom";
import { SlideIn } from "../../module/motion";

export default function Goods({ all }) {
  const [items, setitems] = useState([]);

  useEffect(() => {
    !all ? setitems(PRODUCT_LIST.slice(0, 3)) : setitems(PRODUCT_LIST);
  }, []);

  return (
    <section className="goods sect" id="goods">
      <div className="container ">
        <SectionHead
          title={"товары"}
          discription={
            "Мы разрабатываем и производим полную линейку биопрепаратов для современного сельского хозяйства. <br/> Наша продукция охватывает все ключевые задачи — от защиты растений и повышения урожайности до обеспечения здоровья животных и безопасности кормов."
          }
        />
        <div className="goods-list">
          {items.map((e, i) => (
            <SlideIn key={i} delays={i / 10}>
              <GoodsItem
                id={e.id}
                img={e.img}
                title={e.title}
                discription={e.description}
                url={e.url}
              />
            </SlideIn>
          ))}
        </div>

        {!all ? (
          <a href={"/our_products"} className={"goods-link button -t2"}>
            <span>Смотреть еще</span>
          </a>
        ) : (
          ""
        )}
      </div>
    </section>
  );
}

const GoodsItem = ({ img, title, id, discription, url }) => {
  return (
    <>
      {url !== null ? (
        <a href={`/our_products/${url}`} className="goods-list_item">
          <div className="img_box">
            <img className="img" src={img} alt={title} />
          </div>
          <div className="clue">
            <div className="link flex--sb">
              <p className="title">{title}</p>

              <svg
                width="22"
                height="17"
                viewBox="0 0 22 17"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path d="M13.1795 2.67872C13.0564 2.56353 12.9576 2.42462 12.8892 2.27028C12.8207 2.11595 12.7838 1.94934 12.7809 1.7804C12.7779 1.61146 12.8089 1.44365 12.8719 1.28698C12.9349 1.13031 13.0287 0.987995 13.1477 0.868519C13.2667 0.749042 13.4084 0.654853 13.5644 0.591573C13.7205 0.528292 13.8876 0.497215 14.0559 0.500196C14.2241 0.503177 14.39 0.540153 14.5437 0.608922C14.6974 0.67769 14.8358 0.77684 14.9505 0.900457L21.6335 7.61087C21.8682 7.84679 22 8.16658 22 8.5C22 8.83343 21.8682 9.15322 21.6335 9.38913L14.9505 16.0995C14.8358 16.2232 14.6974 16.3223 14.5437 16.3911C14.39 16.4598 14.2241 16.4968 14.0559 16.4998C13.8876 16.5028 13.7205 16.4717 13.5644 16.4084C13.4084 16.3451 13.2667 16.251 13.1477 16.1315C13.0287 16.012 12.9349 15.8697 12.8719 15.713C12.8089 15.5564 12.7779 15.3885 12.7809 15.2196C12.7838 15.0507 12.8207 14.8841 12.8892 14.7297C12.9576 14.5754 13.0564 14.4365 13.1795 14.3213L17.724 9.7582L1.53432 9.7582C1.20198 9.7582 0.883261 9.62564 0.648264 9.38968C0.413269 9.15372 0.28125 8.8337 0.28125 8.5C0.28125 8.16631 0.413269 7.84628 0.648264 7.61032C0.883261 7.37436 1.20198 7.2418 1.53432 7.2418L17.724 7.2418L13.1795 2.67872Z" />
              </svg>
            </div>

            <div className="discription">{discription}</div>
          </div>
        </a>
      ) : (
        <div className="goods-list_item">
          <div className="img_box">
            <img className="img" src={img} alt={title} />
          </div>
          <div className="clue">
            <div className="link flex--sb">
              <p className="title">{title}</p>

              <svg
                width="22"
                height="17"
                viewBox="0 0 22 17"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path d="M13.1795 2.67872C13.0564 2.56353 12.9576 2.42462 12.8892 2.27028C12.8207 2.11595 12.7838 1.94934 12.7809 1.7804C12.7779 1.61146 12.8089 1.44365 12.8719 1.28698C12.9349 1.13031 13.0287 0.987995 13.1477 0.868519C13.2667 0.749042 13.4084 0.654853 13.5644 0.591573C13.7205 0.528292 13.8876 0.497215 14.0559 0.500196C14.2241 0.503177 14.39 0.540153 14.5437 0.608922C14.6974 0.67769 14.8358 0.77684 14.9505 0.900457L21.6335 7.61087C21.8682 7.84679 22 8.16658 22 8.5C22 8.83343 21.8682 9.15322 21.6335 9.38913L14.9505 16.0995C14.8358 16.2232 14.6974 16.3223 14.5437 16.3911C14.39 16.4598 14.2241 16.4968 14.0559 16.4998C13.8876 16.5028 13.7205 16.4717 13.5644 16.4084C13.4084 16.3451 13.2667 16.251 13.1477 16.1315C13.0287 16.012 12.9349 15.8697 12.8719 15.713C12.8089 15.5564 12.7779 15.3885 12.7809 15.2196C12.7838 15.0507 12.8207 14.8841 12.8892 14.7297C12.9576 14.5754 13.0564 14.4365 13.1795 14.3213L17.724 9.7582L1.53432 9.7582C1.20198 9.7582 0.883261 9.62564 0.648264 9.38968C0.413269 9.15372 0.28125 8.8337 0.28125 8.5C0.28125 8.16631 0.413269 7.84628 0.648264 7.61032C0.883261 7.37436 1.20198 7.2418 1.53432 7.2418L17.724 7.2418L13.1795 2.67872Z" />
              </svg>
            </div>

            <div className="discription">{discription}</div>
          </div>
        </div>
      )}
    </>
  );
};
